Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh9-v3.tmx
Source language: bo
Languages: en

source: ཤ་ར་དྭ་ཏིའི་བུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་གང་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཟབ་མོ་འདི་ཐོས་ནས། མི་འཇིགས་མི་སྔང་སྐྲག་པར་མི་འགྱུར་ཞིང་ཐོས་ནས་ཀྱང་གོང་ནས་གོང་དུ་འཛིན་པ་དང་། འཆང་བ་དང་ཀློག་པ་དང་ཀུན་ཆུབ་པར་བྱེད་པ་དང་། ཇི་ལྟར་བསྟན་པའི་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་གནས་པ་དེ་དག་ནི་ཡུན་རིང་པོ་ནས་ཐེག་པ་ལ་ཡང་དག་པར་ཞུགས་པའོ།
en: Śāradvatīputra, those bodhisattva great beings who, having heard this profound perfection of wisdom, will not be fearful, afraid, or terrified, and who, having heard it, will increasingly take up, uphold, recite, master, and maintain the perfection of wisdom, just as it has been taught, will have entered into the vehicle for a long period of time.

source: །ཕ་རོལ་དུ་ཕྱིན་པ་དྲུག་ལ་སྤྱད་པའོ།
en: They will have practiced the six perfections.

source: །སངས་རྒྱས་མང་པོ་ལ་བསྙེན་བཀུར་བྱས་པའོ།
en: They will have venerated many buddhas.”

source: །ཤ་ར་དྭ་ཏིའི་བུས་གསོལ་པ། བཅོམ་ལྡན་འདས་དེའི་དཔེ་གསལ་བར་བདག་གིས་སྤོབས་སོ།
en: Śāradvatīputra then declared, “Blessed Lord, I am inspired to elucidate this by way of some analogies!

source: །བདེ་བར་གཤེགས་པ་དེའི་དཔེ་གསལ་བར་བདག་གིས་སྤོབས་སོ། །བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ།
en: Sugata, I am inspired to elucidate this by way of some analogies!” “

source: ཤ་ར་དྭ་ཏིའི་བུ་ཁྱོད་ཀྱིས་སྤོབས་པ་སྐྱེད་ཅིག །ཤ་ར་དྭ་ཏིའི་བུས་གསོལ་པ།
en: Śāradvatīputra, be inspired!”

source: བཅོམ་ལྡན་འདས་འདི་ལྟ་སྟེ་དཔེར་ན།
en: replied the Blessed One. “

source: བྱང་ཆུབ་སེམས་དཔའི་ཐེག་པ་པའི་རིགས་ཀྱི་བུའམ་རིགས་ཀྱི་བུ་མོའི་རྨི་ལམ་ན་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་བསྒོམ་ཞིང་བསམ་གཏན་ལ་སྙོམས་པར་འཇུག་པ་དང་། བརྩོན་འགྲུས་རྩོམ་པ་དང་། བཟོད་པ་བསྒྲུབས་པ་དང་། ཚུལ་ཁྲིམས་བསྲུང་བ་དང་། སྦྱིན་པ་ཡོངས་སུ་གཏོང་བ་ནས། སྙིང་པོ་བྱང་ཆུབ་ལ་མཆིས་པའི་བར་དུ་གྱུར་ན་ཡང་བཅོམ་ལྡན་འདས་རིགས་ཀྱི་བུའམ་རིགས་ཀྱི་བུ་མོ་དེ་ནི་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ཉེ་བར་གྱུར་པར་རིག་པར་བགྱི་ན།
en: Blessed Lord,” said Śāradvatīputra, “it is just as if noble sons or noble daughters who follow the vehicle of the bodhisattvas in a dream were to cultivate the perfection of wisdom, be absorbed in the meditative concentrations, undertake perseverance, practice tolerance, maintain ethical discipline, and practice generosity, and then reach as far as the site of enlightenment—one would then know, Blessed Lord, that those noble sons or noble daughters have indeed drawn near to unsurpassed, complete enlightenment.

source: བཅོམ་ལྡན་འདས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་གཉིད་ཀྱིས་མ་ལོག་པ་ཞིག་གིས། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་བསྒོམས་པ་དང་། བསམ་གཏན་ལ་མཉམ་པར་བཞག་པ་དང་། བརྩོན་འགྲུས་བརྩམས་པ་དང་། བཟོད་པ་བསྒྲུབས་པ་དང་།
en: Blessed Lord, what need one say about bodhisattva great beings who, when they are not asleep, have cultivated the perfection of wisdom, been absorbed in the meditative concentrations, undertaken perseverance, practiced tolerance, maintained ethical discipline, and practiced generosity!

source: ཚུལ་ཁྲིམས་བསྲུངས་པ་དང་། སྦྱིན་པ་ཡོངས་སུ་བཏང་བ་ལྟ་སྨོས་ཀྱང་ཅི་འཚལ་ཏེ། བཅོམ་ལྡན་འདས་རིགས་ཀྱི་བུའམ་རིགས་ཀྱི་བུ་མོ་དེ་ནི་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ཉེ་བར་གྱུར་པར་རིག་པར་བགྱིའོ།
en: Blessed Lord, one would know that those [latter] noble sons or noble daughters have drawn near to unsurpassed, complete enlightenment.

source: །བཅོམ་ལྡན་འདས་གང་གིས་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཟབ་མོ་འདི་ཐོས་པར་གྱུར་ཏེ། ཐོས་ནས་ཀྱང་འཛིན་ཅིང་དེ་བཞིན་ཉིད་ཏུ་ནན་ཏན་དུ་བགྱིད་པ་དེ་དག་ནི། དགེ་བའི་རྩ་བ་ཡོངས་སུ་སྨིན་པ་སྟེ།
en: Blessed Lord, those who have heard this profound perfection of wisdom, and, having heard it, then retain it and earnestly apply it in an authentic manner, will ripen the roots of virtuous action.

source: བཅོམ་ལྡན་འདས་བྱང་ཆུབ་སེམས་དཔའ་གང་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཟབ་མོ་འདི་འཛིན་ཅིང་འཆང་བ་དང་། ཀློག་ཅིང་ཀུན་ཆུབ་པར་བགྱིད་པ་དང་། ཚུལ་བཞིན་དུ་ཡིད་ལ་བགྱིད་པ་དེ་དག་ནི་ཡུན་རིང་པོ་ནས། ཐེག་པ་ལ་ཡང་དག་པར་ཞུགས་ཤིང་དགེ་བའི་རྩ་བ་བསྐྱེད་པའོ།
en: Blessed Lord, bodhisattva great beings who take up, uphold, recite, master, and focus their attention correctly on this profound perfection of wisdom will have entered the vehicle for a long period of time and will have cultivated the roots of virtuous action.

source: །སངས་རྒྱས་མང་པོ་བསྙེན་བཀུར་བའོ།
en: They will have venerated many buddhas.

source: །དགེ་བའི་བཤེས་གཉེན་གྱིས་ཡོངས་སུ་བཟུང་བའོ།
en: They will have been accepted by spiritual mentors.

source: །བཅོམ་ལྡན་འདས་རིགས་ཀྱི་བུ་དང་རིགས་ཀྱི་བུ་མོ་དེ་དག་ནི་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ལུང་བསྟན་པ་དང་ཉེ་བར་གྱུར་པ་སྟེ།
en: Blessed Lord, those noble sons or noble daughters are near to being prophesied to attain unsurpassed, complete enlightenment.

source: བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ལུང་བསྟན་པར་འགྱུར་རོ།
en: They will be prophesied to attain unsurpassed, complete enlightenment.

source: །བཅོམ་ལྡན་འདས་རིགས་ཀྱི་བུ་དང་། རིགས་ཀྱི་བུ་མོ་གང་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཟབ་མོ་འདི་འཐད་ཅིང་འཐད་པར་གྱུར་ནས་ཀྱང་འཛིན་པ་དང་འཆང་བ་དང་ཀློག་པ་དང་ཀུན་ཆུབ་པར་བགྱིད་པ་དང་། ཚུལ་བཞིན་དུ་ཡིད་ལ་བགྱིད་པའི་རིགས་ཀྱི་བུ་དང་། རིགས་ཀྱི་བུ་མོ་དེ་དག་ནི་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ལས་ཕྱིར་མི་ལྡོག་པར་རིག་པར་བགྱི་བདག་གོ། །བཅོམ་ལྡན་འདས་འདི་ལྟ་སྟེ་དཔེར་ན། སྐྱེས་བུ་ལ་ལ་འབྲོག་དགོན་པ་དཔག་ཚད་བརྒྱ་པ་ཞིག་ནས་འབྱུང་ངམ། འབྲོག་དགོན་པ་དཔག་ཚད་ཉིས་བརྒྱ་པ་དང་། སུམ་བརྒྱ་པ་དང་བཞི་བརྒྱ་པ་དང་། ལྔ་བརྒྱ་པ་ནས་འབྱུང་བ་ཞིག་མཆིས་ལ། དེ་འབྱུང་བའི་ཚེ་གྲོང་དང་། གྲོང་ཁྱེར་དང་གྲོང་རྡལ་དང་ཁམས་དང་རྒྱལ་པོའི་ཕོ་བྲང་འཁོར་གྱི་སྔ་ལྟས་བ་ལང་རྫི་འམ།
en: Blessed Lord, those noble sons or noble daughters who accord with this profound perfection of wisdom, and, having accorded with it, then take up, uphold, recite, master, and focus their attention correctly on it should be known to be making progress to unsurpassed, complete enlightenment that is irreversible. {

source: ཕྱུགས་རྫི་འམ།
en: Ki.

source: ས་མཚམས་སམ། བཟའ་ཤིང་གི་ར་བ་ཕུན་སུམ་ཚོགས་པའམ། ནགས་ཚལ་ཕུན་སུམ་ཚོགས་པ་མཐོང་ངམ། དེ་མ་ལགས་པ་གཞན་ཡང་མཚན་མ་གང་གིས་གྲོང་ངམ་གྲོང་ཁྱེར་རམ་གྲོང་རྡལ་ལམ་ཁམས་སམ། རྒྱལ་པོའི་ཕོ་བྲང་འཁོར་མཆིས་པར་མངོན་པའི་སྔ་ལྟས་དེ་ལྟ་བུ་དག་མཐོང་ན། དེ་འདི་སྙམ་དུ་གྱུར་ཏེ། སྔ་ལྟས་འདི་དག་སྣང་བ་ལགས་ན། འདི་ནས་གྲོང་ངམ། གྲོང་ཁྱེར་རམ། གྲོང་རྡལ་ལམ། ཁམས་སམ། རྒྱལ་པོའི་ཕོ་བྲང་འཁོར་ནི་ཉེ་འོ་སྙམ་སྟེ། དབུགས་ཕྱིན་པར་འགྱུར་ཞིང་།
en: IV: 17} “Blessed Lord, it is just as when some men, coming out of a wilderness of one hundred yojanas, or coming out of a wilderness of two hundred, three hundred, four hundred, or five hundred yojanas, might see signs indicative of a village, city, market town, region, or royal capital, such as cowherds, herders, border posts, excellent orchards, or excellent woodlands—or if they were to see, by means of other signs apart from these, that they were clearly approaching a village, city, market town, region, or royal capital—they would think that when these indications appear they are indeed approaching a village, city, market town, region, or royal capital.

source: དེ་ལ་དེ་སླན་ཆད་རྐུན་པོའི་འཇིགས་པའམ། ཆོམ་པོའི་འཇིགས་པའམ། གཅན་ཟན་ཁྲོ་བོའི་འཇིགས་པའམ། བཀྲེས་པ་དང་། སྐོམ་པའི་འཇིགས་པ་མ་མཆིས་སོ།
en: They would be relieved, and thenceforth there would be no fear of robbers, fear of brigands, fear of savage wild beasts, or fear of hunger and thirst.

source: །བཅོམ་ལྡན་འདས་དེ་བཞིན་དུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ལ་གང་གི་ཚེ། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཟབ་མོ་འདི་འཐད་པར་གྱུར་ཏེ། འཐད་པར་གྱུར་ནས་ཀྱང་འཛིན་པ་དང་། འཆང་བ་དང་ཀློག་པ་དང་། ཀུན་ཆུབ་པར་བགྱིད་པ་དང་། ཚུལ་བཞིན་དུ་ཡིད་ལ་བགྱིད་ན། བཅོམ་ལྡན་འདས་དེའི་ཚེ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེ་ནི་ལུང་བསྟན་པ་ལ་ཉེ་བར་གྱུར་པར་རིག་པར་བགྱི་བ་སྟེ།
en: Blessed Lord, in the same way, when bodhisattva great beings have accorded with this profound perfection of wisdom, and, having accorded with it, also taken up, upheld, recited, mastered, and focused their attention correctly on it, one should know that at that time, Blessed Lord, those bodhisattva great beings are near to being prophesied and before long they will attain consummate buddhahood in unsurpassed, complete enlightenment.

source: རིང་པོར་མི་ཐོགས་པར་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་འགྱུར་རོ། །བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེས། དེ་སླན་ཆད་ཉན་ཐོས་ཀྱི་སའམ། རང་སངས་རྒྱས་ཀྱིས་ས་འཇིགས་པར་མི་བགྱིའོ།
en: Thenceforth those bodhisattva great beings will not fear the level of the śrāvakas or the level of the pratyekabuddhas.

source: །དེ་ཅིའི་སླད་དུ་ཞེ་ན། འདི་ལྟ་སྟེ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཟབ་མོ་འདི་བལྟ་བ་དང་། ཕྱག་བགྱི་བ་དང་། མཉན་དུ་མཆིས་པ་དེ་ཉིད་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཀྱི་སྔ་ལྟས་སོ།
en: If one were to ask why, it is because the sight of this profound perfection of wisdom, paying homage to it and listening to it, are indications heralding unsurpassed, complete enlightenment.” “

source: །བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། ཤ་ར་དྭ་ཏིའི་བུ་དེ་དེ་བཞིན་ནོ། །དེ་དེ་བཞིན་ཏེ།
en: It is so, Śāradvatīputra. It is so!” replied the Blessed One. “

source: ཤ་ར་དྭ་ཏིའི་བུ་ཁྱོད་ཀྱིས་ད་དུང་ཡང་སངས་རྒྱས་ཀྱི་མཐུས་སྤོབས་པ་བསྐྱེད་ཅིག །གསོལ་པ།
en: Śāradvatīputra, may you now again be inspired by the power of the buddhas!” “

source: བཅོམ་ལྡན་འདས་འདི་ལྟ་སྟེ་དཔེར་ན། སྐྱེས་བུ་ལ་ལ་ཞིག་རྒྱ་མཚོ་མཆིད་རྣམས་ཆེན་པོ་བལྟ་བར་འཚལ་ནས། དེ་རྒྱ་མཚོ་ཆེན་པོ་བལྟ་བའི་སླད་དུ། དེ་ཇི་ལྟ་ཇི་ལྟར་རྒྱ་མཚོ་ཆེན་པོ་དང་ཉེ་བར་མཆིས་པ་དེ་ལྟ་དེ་ལྟར་ལྡུམ་བུ་འམ་ལྡུམ་བུའི་མཚན་མའམ། རིའམ།
en: Blessed Lord, it is just as if there were some men wishing to see the shores of the great ocean—the closer they approached the great ocean in order to see it, the more they would no longer see trees or the indications of a tree, or hills or the indication of a hill, [and they would know] on that basis that the great ocean is near, the great ocean is not far away. {

source: རིའི་མཚན་མ་མཐོང་ན།
en: Ki.

source: དེས་འདི་ནས་རྒྱ་མཚོ་ཆེན་པོ་ཐག་ཉེ་སྟེ། འདི་ནས་རྒྱ་མཚོ་ཆེན་པོ་རིང་པོ་མེད་དོ། །དེ་ཅིའི་ཕྱིར་ཞེ་ན། རྒྱ་མཚོ་ཆེན་པོ་ནི་བགས་ཀྱིས་གཞོལ་བ་སྟེ། འདི་ནས་རྒྱ་མཚོ་ཆེན་པོའི་དྲུང་དུ་ད་ནི་རིང་པོ་མེད་དོ།
en: IV: 18} If one were to ask why, they would instinctively know that now the great ocean is near and not far away.

source: །དེ་དང་ཉེ་བ་ན་ནི་ལྡུམ་བུ་འམ། ལྡུམ་བུའི་མཚན་མ་འམ། རི་འམ་རིའི་མཚན་མ་གང་ཡང་མེད་དོ་ཞེས་བགྱི་བར་རིག་གོ།
en: If it is near there will be no trees or the indication of a tree, and no hills or the indication of a hill.

source: དེ་ལྟར་སྐྱེས་བུ་དེའི་མིག་གི་རྒྱ་མཚོ་ཆེན་པོ་མ་མཐོང་དུ་ལགས་ཀྱང་། དེས་བདག་ནི་རྒྱ་མཚོ་ཆེན་པོ་དང་ཉེ་བར་གྱུར་ཏོ། །རྒྱ་མཚོ་ཆེན་པོ་ནི་འདི་ན་ཡོད་དོ། །རྒྱ་མཚོ་ཆེན་པོ་ནི་འདི་ཕན་ཆད་མི་རིང་ངོ་ཞེས་བགྱི་བར་རྟོགས་པར་འཚལ་ཏོ།
en: So even though the eyes of those men do not yet see the great ocean, they understand that they are nearing the great ocean, and that the great ocean is in the vicinity, the great ocean is not far away.

source: །བཅོམ་ལྡན་འདས་དེ་བཞིན་དུ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཟབ་མོ་འདི་ཉན་ཅིང་འཛིན་པ་དང་། འཆང་ཞིང་ཀློག་པ་དང་། ཀུན་ཆུབ་པར་བགྱིད་པ་དང་། ཚུལ་བཞིན་དུ་ཡིད་ལ་བགྱིད་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་ཀྱང་། བདག་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཀྱིས་ཁྱོད་བསྐལ་པ་ནི་འདི་སྙེད་ཅིག །བསྐལ་པ་བརྒྱ་ཕྲག་ནི་འདི་སྙེད་ཅིག །བསྐལ་པ་སྟོང་ཕྲག་ནི་འདི་སྙེད་ཅིག །བསྐལ་པ་བརྒྱ་སྟོང་གི་ཕྲག་ནི་འདི་སྙེད་ཅིག །བསྐལ་པ་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་གི་ཕྲག་ནི་འདི་སྙེད་ཅིག་ན། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་འཚང་རྒྱ་བར་འགྱུར་རོ་ཞེས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་སུམ་དུ་ལུང་བསྟན་པས་ད་དུང་ལུང་མ་བསྟན་གྱིས་ཀྱང་། བདག་ནི་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ལུང་བསྟན་པ་དང་ཉེ་བར་གནས་པར་བལྟའོ། །དེ་ཅིའི་སླད་དུ་ཞེ་ན།
en: In the same way, Blessed Lord, bodhisattva great beings who hear, take up, uphold, recite, master, and focus their attention correctly on this profound perfection of wisdom should understand that they are near to being prophesied to attain unsurpassed, complete enlightenment, even though the tathāgatas, arhats, completely awakened buddhas have not yet prophesied them with the words, ‘You will attain consummate buddhahood in unsurpassed, complete enlightenment within so many eons, within so many hundreds of eons, within so many thousands of eons, or within so many hundred billion trillions of eons.’

source: དེ་ནི་འདི་ལྟར་བདག་གིས་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཟབ་མོ་འདི་བལྟ་བ་དང་། ཕྱག་བྱ་བ་དང་། བསྙེན་བཀུར་དུ་ཡོད་ལ་མཉན་དུ་ཡོད་དོ། །ཐོས་ནས་ཀྱང་གཟུང་དུ་ཡོད་དོ། །བཅད་དུ་ཡོད། ཀླག་དུ་ཡོད། ཀུན་ཆུབ་པར་བྱར་ཡོད་ཚུལ་བཞིན་དུ་ཡིད་ལ་བྱར་ཡོད་དོ་ཞེས་བགྱི་བར་རིག་པར་བགྱིའོ།
en: If one were to ask why, it is because they would know, ‘I am observing, paying homage to, and listening to this profound perfection of wisdom, and, having heard it, I am holding it, retaining it, reciting it, and mastering it, focusing my attention correctly on it.’ “

source: །བཅོམ་ལྡན་འདས་འདི་ལྟ་སྟེ་དཔེར་ན། དཔྱིད་ཀྱི་དུས་ལ་བབ་སྟེ། རྩི་ཤིང་གི་ལོ་མ་དང་འདབ་མ་ལྷགས་ནས་ཁ་དོག་གྱུར་པའི་ཚེ། འཛམ་བུའི་གླིང་གི་མི་རྣམས་ཀྱིས། རིང་པོ་མི་ཐོགས་པར་ལོ་མ་དང་མེ་ཏོག་དང་འབྲས་བུ་འབྱུང་བར་འགྱུར་རོ། །དེ་ཅིའི་སླད་དུ་ཞེ་ན། དེ་ནི་འདི་ལྟར་སྔ་ལྟས་འདི་དག་རྩི་ཤིང་ལས་སྣང་ངོ་ཞེས་བགྱི་བར་འཚལ་བར་བགྱི་སྟེ།
en: Blessed Lord, it is just as when spring approaches and the leaves and petals of plants appear and change color—the people of Jambudvīpa know that leaves, flowers, and fruits will appear before long because these are the indications that appear from plants.

source: གང་གི་ཚེ་རྩི་ཤིང་རྣམས་ལོ་མ་དང་མེ་ཏོག་དང་། འབྲས་བུ་ཕུན་སུམ་ཚོགས་པར་གྱུར་པ་དེའི་ཚེ་ཡང་བུད་མེད་དང་སྐྱེས་པ་དང་ཁྱེའུ་དང་། བུ་མོ་དག་གིས་རྩི་ཤིང་གི་ལོ་མ་དང་མེ་ཏོག་དང་། འབྲས་བུ་ཕུན་སུམ་ཚོགས་པ་དེ་དག་མཐོང་ནས། ཉམས་བདེ་བར་འགྱུར་རོ།
en: When plants turn to excellent leaves, flowers, and fruits, women, men, boys, and girls, on seeing those plants with excellent leaves, flowers, and fruits, feel happy.

source: །བཅོམ་ལྡན་འདས་དེ་བཞིན་དུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཡང་གང་གི་ཚེ། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཟབ་མོ་འདི་བལྟ་བ་དང་། ཕྱག་བགྱི་བ་དང་། བསྙེན་བཀུར་བ་དང་། མཉན་དུ་མཆིས་ཏེ།
en: Blessed Lord, in the same way, when bodhisattva great beings see, pay homage to, venerate, and listen to this profound perfection of wisdom, and, having heard it, {Ki.

source: ཐོས་ནས་ཀྱང་འཛིན་ཅིང་འཆང་བ་དང་། ཀློག་ཅིང་ཀུན་ཆུབ་པར་བགྱིད་པ་དང་། ཚུལ་བཞིན་དུ་ཡིད་ལ་བགྱིད་པ་དེའི་ཚེ། བཅོམ་ལྡན་འདས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེ་ནི་དགེ་བའི་རྩ་བ་ཡོངས་སུ་སྨིན་པར་རིག་པར་བགྱིའོ།
en: IV: 19} also take up, uphold, recite, master, and focus their attention correctly on it, at that time, Blessed Lord, one should know that those bodhisattva great beings have ripened the roots of virtuous action.

source: །བཅོམ་ལྡན་འདས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེ་ནི་སངས་རྒྱས་མང་པོ་ལ་བསྙེན་བཀུར་བགྱིས་པར་རིག་པར་བགྱིའོ།
en: Blessed Lord, one should know that those bodhisattva great beings have venerated many buddhas.

source: །བཅོམ་ལྡན་འདས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེས་ཀྱང་འདི་ལྟར་བདག་གིས་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཟབ་མོ་འདི་བལྟ་བ་དང་། ཕྱག་བྱ་བ་དང་། བསྙེན་བཀུར་བ་དང་། མཉན་དུ་ཡོད་པ་དང་། ཇི་སྐད་དུ་བསྟན་པའི་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་ནན་ཏན་བྱར་ཡོད་པ་ནི། སྔོན་གྱི་དགེ་བའི་རྩ་བས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ཉེ་བར་གྱུར་ཏོ་ཞེས་བགྱི་བར་འཚལ་བར་བགྱིའོ།
en: Blessed Lord, those bodhisattva great beings should know that since they themselves see, pay homage to, and listen to this profound perfection of wisdom, and earnestly apply the perfection of wisdom just as it has been revealed, through their former roots of virtuous action, they have drawn near to unsurpassed, complete enlightenment.

source: །དེ་ན་ལྷའི་བུ་སྔོན་སངས་རྒྱས་མཐོང་བ་ཇི་སྙེད་ཅིག་མཆིས་པ་དེ་དག་ཀྱང་། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེའི་སྔ་ལྟས་དེ་དག་མཐོང་ནས། སྔོན་གྱི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ལུང་བསྟན་པར་འགྱུར་བ་ལ་ཡང་སྔ་ལྟས་འདི་དག་བྱུང་གིས། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་འདིའང་རིང་པོར་མི་ཐོགས་པར་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ལུང་བསྟན་པར་འགྱུར་རོ་ཞེས་དགའ་ཞིང་སྤྲོ་ལ། ཡིད་བདེ་ཞིང་ཉམས་བདེ་བར་འགྱུར་རོ།
en: Thereupon, all those gods who have seen the buddhas of the past will observe the indications of those bodhisattva great beings and then rejoice, overjoyed, contented, and happy, that these bodhisattva great beings will be prophesied to attain unsurpassed, complete enlightenment before long, since the bodhisattva great beings of the past also experienced those indications that they would be prophesied [to attain enlightenment]. “

source: །བཅོམ་ལྡན་འདས་འདི་ལྟ་སྟེ་དཔེར་ན། བུད་མེད་སྦྲུམ་པ་ནི་ཇི་ལྟ་ཇི་ལྟར་བཙར་ཉེ་བ་དེ་ལྟ་དེ་ལྟར་ལུས་འགྱུར་ཏེ། དེ་ལྟ་དེ་ལྟར་སླར་ཞིང་ལུས་ངལ་ལ་རྒྱུད་ཞན་ཞིང་མི་དགའ་ལ་ཁ་ཟས་ཡི་གར་མི་མཆི་ཞིང་རྨུགས་པ་དང་། གཉིད་ཀྱང་ཆུང་དུ་འགྱུར་ཏེ། ཉམས་མི་བདེ་བ་དེས་སྨྲ་བ་ཉུང་ཞིང་།
en: Blessed Lord, it is just as when a pregnant woman undergoes physical changes as the time to give birth approaches—her body becomes more and more unshapely and lethargic, her mind becomes weak and irritable, her appetite is reduced, her senses become dull, she sleeps less and feels uncomfortable—because of her feelings she speaks little and abstains from intimate contact, feeling that such sensations are due to the inappropriate attentions in which she formerly indulged and on which she relied.

source: བསྟེན་པའི་ངང་ཚུལ་མ་མཆིས་ལ། སྔོན་གྱི་ཚུལ་བཞིན་མ་ལགས་པའི་ཡིད་ལ་བགྱིད་པ་བསྟེན་པ་དང་བསྙེན་པ་དེས་རྣམ་པ་དེ་ལྟ་བུའི་ཚོར་བ་མྱོང་བར་འགྱུར་ཏེ། བུད་མེད་གཞན་དག་གིས་བུད་མེད་དེའི་མཚན་མ་ཇི་ལྟ་ཇི་ལྟར་མཐོང་བ་ལས་བུད་མེད་འདི་ནི་རིང་པོར་མི་ཐོགས་པར་བཙའ་བར་འགྱུར་རོ་ཞེས་བགྱི་བར་འཚལ་ཏོ།
en: Other women will know, the more they see this woman with such symptoms, that she will give birth before long.

source: །བཅོམ་ལྡན་འདས་དེ་བཞིན་དུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དགེ་བའི་རྩ་བ་བསྐྱེད་པ། སངས་རྒྱས་མང་པོ་ལ་བསྙེན་བཀུར་བ། ལེགས་པའི་སྤྱོད་པ་སྤྱད་པ། དགེ་བའི་བཤེས་གཉེན་གྱིས་ཡོངས་སུ་བཟུང་བ། དགེ་བའི་རྩ་བ་ཡོངས་སུ་སྨིན་པ་རྣམས་ལ་ཡང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཟབ་མོ་འདི་འཐད་པར་འགྱུར་ཏེ། འཐད་པར་གྱུར་ནས་ཀྱང་འཛིན་ཅིང་འཆང་བ་དང་།
en: Blessed Lord, in the same way, when those bodhisattva great beings who have grown the roots of virtuous action, venerated many buddhas, practiced good conduct, been accepted by a spiritual mentor, and brought the roots of virtuous action to maturity accord with this profound perfection of wisdom, and, having accorded with it, also take up, uphold, recite, master, and focus their attention correctly on it, then, Blessed Lord, one should know that those bodhisattva great beings will be prophesied to attain unsurpassed, complete enlightenment before long.” “

source: ཀློག་ཅིང་ཀུན་ཆུབ་པར་བགྱིད་པ་དང་།
en: Excellent, Śāradvatīputra!

source: ཚུལ་བཞིན་དུ་ཡིད་ལ་བགྱིད་ན། བཅོམ་ལྡན་འདས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེ་དག་རིང་པོར་མི་ཐོགས་པར་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ལུང་བསྟན་པར་འགྱུར་བར་རིག་པར་བགྱིའོ།
en: Excellent!”

source: ཤ་ར་དྭ་ཏིའི་བུ་ལེགས་སོ་ལེགས་སོ། །ཤ་ར་དྭ་ཏིའི་བུ་ཁྱོད་ཀྱིས་སྤོབས་པ་དེ་ནི་སངས་རྒྱས་ཀྱི་མཐུས་སྐྱེས་སོ། །དེ་ནས་ཚེ་དང་ལྡན་པ་རབ་འབྱོར་གྱིས།
en: Śāradvatīputra, this inspired speech of yours arises through the power of the buddhas.”

source: བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རྣམས་ཀྱིས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེ་དག་དེ་ལྟར་ལེགས་པར་ཡོངས་སུ་གཟུང་བ་ནི་ངོ་མཚར་ཆེའོ།
en: Then the venerable Subhūti said to the Blessed One, “Blessed Lord, it is most wonderful that the tathāgatas, arhats, completely awakened buddhas will sustain those bodhisattva great beings so perfectly in that manner.” {

source: རབ་འབྱོར་འདི་ལྟར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེ་དག་ནི་སྐྱེ་བོ་མང་པོ་ལ་ཕན་པ་དང་། སྐྱེ་བོ་མང་པོ་ལ་བདེ་བ་དང་། འཇིག་རྟེན་ལ་སྙིང་བརྩེ་བ་དང་། ལྷ་དང་མིའི་ཚོགས་སྐྱེ་བོ་ཕལ་པོ་ཆེའི་དོན་དང་། ཕན་པ་དང་བདེ་བའི་ཕྱིར།
en: IV: 20} “Subhūti,” replied the Blessed One, “it is in order to act for the benefit of many living creatures, to bring happiness to many living creatures, to act out of compassion for the world, and to act for the well-being, benefit, and happiness of a multitude of gods and human beings that those bodhisattva great beings have embarked in this way on unsurpassed, complete enlightenment.

source: བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ཡང་དག་པར་འཇུག་སྟེ། དེ་དག་བྱང་ཆུབ་སེམས་དཔའི་སྤྱད་པ་སྤྱོད་པའི་ཚེ། བསྡུ་བའི་དངོས་པོ་བཞིས་སེམས་ཅན་བརྒྱ་སྟོང་མང་པོ་ལ་ཕན་འདོགས་ཏེ།
en: While they are practicing the conduct of a bodhisattva they benefit many hundreds and thousands of living creatures through the four attractive qualities of a bodhisattva.

source: བཞི་གང་ཞེ་ན། སྦྱིན་པ་དང་། སྙན་པར་སྨྲ་བ་དང་། དོན་དུ་སྤྱོད་པ་དང་། དོན་འཐུན་པར་སྤྱོད་པ་སྟེ།
en: If you ask what these four are, they comprise generosity, pleasant speech, purposeful activity, and harmonious activity.

source: དེ་དག་གིས་སེམས་ཅན་རྣམས་དགེ་བ་བཅུའི་ལས་ཀྱི་ལམ་ལ་ཡང་དག་པར་བསྐུལ་ལོ།
en: Through these qualities they encourage beings toward the paths of the ten virtuous actions. “

source: །བདག་ཀྱང་བསམ་གཏན་བཞི་དང་། ཚད་མེད་པ་བཞི་དང་། གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་བཞི་ལ་སྙོམས་པར་འཇུག་ལ་གཞན་ཡང་བསམ་གཏན་བཞི་དང་། ཚད་མེད་པ་བཞི་དང་། གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་བཞི་ལ་ཡང་དག་པར་བསྐུལ་ལོ།
en: They themselves are absorbed in the four meditative concentrations, the four immeasurable attitudes, and the four formless absorptions, and they also encourage others toward the four meditative concentrations, the four immeasurable attitudes, and the four formless absorptions.

source: །བདག་ཀྱང་སྦྱིན་པ་ཡོངས་སུ་གཏོང་ལ། གཞན་ཡང་སྦྱིན་པ་ལ་ཡང་དག་པར་བསྐུལ་ལོ།
en: They themselves practice generosity and they also encourage others toward generosity.

source: །བདག་ཀྱང་ཚུལ་ཁྲིམས་སྲུང་ལ། གཞན་ཡང་ཚུལ་ཁྲིམས་ལ་ཡང་དག་པར་བསྐུལ་ལོ།
en: They themselves maintain ethical discipline, and they also encourage others toward ethical discipline.

source: །བདག་ཀྱང་བཟོད་པ་བསྒོམ་ལ། གཞན་ཡང་བཟོད་པ་བསྒོམ་ལ།
en: They themselves cultivate tolerance and they also encourage others toward tolerance.

source: གཞན་ཡང་བཟོད་པ་ལ་ཡང་དག་པར་བསྐུལ་ལོ། །བདག་ཀྱང་བརྩོན་འགྲུས་རྩོམ་ལ། གཞན་ཡང་བརྩོན་འགྲུས་ལ་ཡང་དག་པར་བསྐུལ་ལོ།
en: They themselves undertake perseverance and they also encourage others toward perseverance.

source: །བདག་ཀྱང་བསམ་གཏན་ལ་སྙོམས་པར་འཇུག་ལ། གཞན་ཡང་བསམ་གཏན་ལ་ཡང་དག་པར་བསྐུལ་ལོ།
en: They themselves are absorbed in meditative concentration and they also encourage others toward meditative concentration.

source: །བདག་ཀྱང་ཤེས་རབ་སྒོམ་ལ། གཞན་ཡང་ཤེས་རབ་སྒོམ་པ་ལ་ཡང་དག་པར་བསྐུལ་ལོ།
en: They themselves cultivate wisdom and they also encourage others toward wisdom.

source: །དེ་དག་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་གནས་ཤིང་། ཐབས་མཁས་པས་སེམས་ཅན་རྣམས་རྒྱུན་དུ་ཞུགས་པའི་འབྲས་བུ་ལ་རབ་ཏུ་འགོད་ཀྱང་བདག་རྒྱུན་དུ་ཞུགས་པའི་འབྲས་བུ་ཐོབ་པར་མི་བྱེད་དོ།
en: They dwell in the perfection of wisdom, and although through skillful means they establish beings in the fruit of entering the stream to nirvāṇa, they themselves do not attain the fruit of entering the stream to nirvāṇa.

source: །གཞན་ལན་ཅིག་ཕྱིར་འོང་བའི་འབྲས་བུ་དང་། ཕྱིར་མི་འོང་བའི་འབྲས་བུ་དང་། དགྲ་བཅོམ་པ་ཉིད་དང་། རང་བྱང་ཆུབ་ལ་རབ་ཏུ་འགོད་ཀྱང་། བདག་རང་བྱང་ཆུབ་མངོན་དུ་མི་བྱེད་དོ།
en: Although they establish others in the fruit of being destined for only one more rebirth, the fruit of no longer being subject to rebirth, arhatship, and individual enlightenment, they themselves do not actualize individual enlightenment [and so forth]. “

source: །བདག་ཀྱང་སྦྱིན་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་ལ། བྱང་ཆུབ་སེམས་དཔའ་གཞན་སྟོང་ཕྲག་དུ་མ་དག་ཀྱང་། སྦྱིན་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་ཡང་དག་པར་བསྐུལ་ལོ། བདག་ཀྱང་ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བཟོད་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་།
en: They themselves practice the perfection of generosity, and they also encourage many thousands of other bodhisattvas toward the perfection of generosity.

source: བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བསམ་གཏན་གྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་ལ། བྱང་ཆུབ་སེམས་དཔའ་གཞན་སྟོང་ཕྲག་དུ་མ་དག་ཀྱང་། ཚུལ་ཁྲིམས་དང་བཟོད་པ་དང་བརྩོན་འགྲུས་དང་བསམ་གཏན་དང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་ཡང་དག་པར་བསྐུལ་ལོ།
en: They themselves practice the perfection of ethical discipline, the perfection of tolerance, the perfection of perseverance, the perfection of meditative concentration, and the perfection of wisdom, and they also encourage many thousands of other bodhisattvas toward the perfections of ethical discipline, tolerance, perseverance, meditative concentration, and wisdom.

source: །བདག་ཀྱང་ཕྱིར་མི་ལྡོག་པའི་ས་ཡོངས་སུ་གནོན་ལ། གཞན་ཡང་ཕྱིར་མི་ལྡོག་པའི་ས་ལ་རབ་ཏུ་འགོད་དོ།
en: They themselves occupy the level at which progress has become irreversible, and they also establish others in the level at which progress has become irreversible.
